_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасчетПлощадейОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РасчетПлощадейОбъектовНедвижимости</Name>
			<Comment>Расчет площадей объектов недвижимости (УСО)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_СводныеПлощадиПоОбъектуНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоОбмерамБТИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьСобственныхЖилыхПомещений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьСобственныхНежилыхПомещений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьСобственныхМашиномест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьЖилыхПомещенийДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьНежилыхПомещенийДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьМашиноместДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьЖилыхПомещенийИнвест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьНежилыхПомещенийИнвест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьМашиноместИнвест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УПН_ДоговорПоНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПараметрыОбъектовНедвижимостиПоБТИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПараметрыОбъектовНедвижимостиПоБТИ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеДоговоровИДолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеДоговоровИДолей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расторгнут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/АУН_КатегорииОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>АУН_КатегорииОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комната</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Помещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_ТипыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_ТипыНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коммерческая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражМашиноместо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыДоговоровПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыДоговоровПоНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоговорДолевогоУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционныйДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасчетПлощадейОбъектовНедвижимости/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ТекущийОбъектЭксплуатации = Объект.ОбъектЭксплуатации;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьТипыНедвижимости();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийОбъектЭксплуатации)
		И НЕ ТекущийОбъектЭксплуатации = Объект.ОбъектЭксплуатации
		И Не Объект.ОбъектыНедвижимости.Количество() = 0 Тогда
		Ответ = КодВозвратаДиалога.Нет;		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбъектЭксплуатацииПриИзмененииЗавершение", ЭтотОбъект), НСтр("ru = 'Табличная часть содержит данные по объектам недвижимости, которые при изменении будут удалены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);			
		Возврат;
	КонецЕсли;
	
	ТекущийОбъектЭксплуатации = Объект.ОбъектЭксплуатации;

КонецПроцедуры

&НаКлиенте
Процедура ПоОбмерамБТИПриИзменении(Элемент)
	
	Если Не Объект.ОбъектыНедвижимости.Количество() = 0 Тогда
		Ответ = КодВозвратаДиалога.Нет;		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоОбмерамБТИПриИзмененииЗавершение", ЭтотОбъект), НСтр("ru = 'Данные по площадям в табличной части будут перезаполнены, продолжить?'"), РежимДиалогаВопрос.ДаНет);			
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыОбъектыНедвижимости

&НаКлиенте
Процедура ОбъектыНедвижимостиОбъектНедвижимостиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.АУН_ОбъектыНедвижимости.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, "ОбъектЭксплуатации", Объект.ОбъектЭксплуатации, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, "КатегорияОбъекта", ПредопределенноеЗначение("Перечисление.АУН_КатегорииОбъектовНедвижимости.Здание"), ВидСравненияКомпоновкиДанных.НеРавно,,Истина);
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиОбъектНедвижимостиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиОбъектНедвижимостиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыНедвижимости.ТекущиеДанные;
	ЗаполнитьНаСервере(, ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не Объект.ОбъектыНедвижимости.Количество() = 0 Тогда
		Ответ = КодВозвратаДиалога.Нет;		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр("ru = 'Табличная часть предварительно будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);			
		Возврат;
	КонецЕсли;

	ЗаполнитьНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТекущийОбъектЭксплуатации = Объект.ОбъектЭксплуатации;
		Объект.ОбъектыНедвижимости.Очистить();
	Иначе
		Объект.ОбъектЭксплуатации = ТекущийОбъектЭксплуатации;
	Конецесли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ПоОбмерамБТИПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере(Истина);
	Иначе
		Объект.ПоОбмерамБТИ = (Не Объект.ПоОбмерамБТИ);
	Конецесли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
		Модифицированность = Истина;
	Конецесли;    
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьСобственныхЖилыхПомещений.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьЖилыхПомещенийДДУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьЖилыхПомещенийИнвест.Имя);
	
	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыНедвижимости.ТипНедвижимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.УПН_ТипыНедвижимости.Жилая;  
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыНедвижимости.ОбъектНедвижимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьСобственныхНежилыхПомещений.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьНежилыхПомещенийДДУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьНежилыхПомещенийИнвест.Имя);
	
	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыНедвижимости.ТипНедвижимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.УПН_ТипыНедвижимости.Коммерческая;  
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыНедвижимости.ОбъектНедвижимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьСобственныхМашиномест.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьМашиноместДДУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыНедвижимостиПлощадьМашиноместИнвест.Имя);
	
	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыНедвижимости.ТипНедвижимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.УПН_ТипыНедвижимости.ГаражМашиноместо;  
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыНедвижимости.ОбъектНедвижимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	 ЗаполнитьТипыНедвижимости();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ТолькоДанныеПоПлощадям = Ложь, ИдентификаторСтроки = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АУН_ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
	|	АУН_ОбъектыНедвижимости.ТипНедвижимости,
	|	АУН_ОбъектыНедвижимости.КатегорияОбъекта
	|ПОМЕСТИТЬ ВТ_ОбъектыНедвижимости
	|ИЗ
	|	Справочник.АУН_ОбъектыНедвижимости КАК АУН_ОбъектыНедвижимости
	|ГДЕ
	|	НЕ АУН_ОбъектыНедвижимости.ПометкаУдаления
	|	И АУН_ОбъектыНедвижимости.ОбъектЭксплуатации = &ОбъектЭксплуатации
	|	И НЕ АУН_ОбъектыНедвижимости.КатегорияОбъекта = ЗНАЧЕНИЕ(Перечисление.АУН_КатегорииОбъектовНедвижимости.здание)
	|	И ВЫБОР
	|			КОГДА &ОтборПоОбъекту
	|				ТОГДА ВЫБОР
	|						КОГДА АУН_ОбъектыНедвижимости.Ссылка = &ОбъектНедвижимости
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости,
	|	УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости.ТипНедвижимости,
	|	УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости.КатегорияОбъекта,
	|	ЕСТЬNULL(УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТ_ПлощадиОбъектов
	|ИЗ
	|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(
	|			&КонецПериода,
	|			ОбъектНедвижимости В
	|				(ВЫБРАТЬ
	|					ВТ_ОбъектыНедвижимости.ОбъектНедвижимости
	|				ИЗ
	|					ВТ_ОбъектыНедвижимости КАК ВТ_ОбъектыНедвижимости)) КАК УПН_ПлощадиОбъектовНедвижимостиСрезПоследних
	|ГДЕ
	|	НЕ &ПоОбмерамБТИ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УПН_ПараметрыОбъектовНедвижимостиПоБТИСрезПоследних.ОбъектНедвижимости,
	|	УПН_ПараметрыОбъектовНедвижимостиПоБТИСрезПоследних.ОбъектНедвижимости.ТипНедвижимости,
	|	УПН_ПараметрыОбъектовНедвижимостиПоБТИСрезПоследних.ОбъектНедвижимости.КатегорияОбъекта,
	|	ЕСТЬNULL(УПН_ПараметрыОбъектовНедвижимостиПоБТИСрезПоследних.ОбщаяПлощадь, 0)
	|ИЗ
	|	РегистрСведений.УПН_ПараметрыОбъектовНедвижимостиПоБТИ.СрезПоследних(
	|			&КонецПериода,
	|			ОбъектНедвижимости В
	|				(ВЫБРАТЬ
	|					ВТ_ОбъектыНедвижимости.ОбъектНедвижимости
	|				ИЗ
	|					ВТ_ОбъектыНедвижимости КАК ВТ_ОбъектыНедвижимости)) КАК УПН_ПараметрыОбъектовНедвижимостиПоБТИСрезПоследних
	|ГДЕ
	|	&ПоОбмерамБТИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Доля КАК ОбъектНедвижимости,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Регистратор КАК ДоговорПоНедвижимости,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Расторгнут,
	|	УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Договор,
	|	ВЫБОР
	|		КОГДА НЕ УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Расторгнут
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(УСОERP_СоответствиеДоговоровИДолейСрезПоследних.Регистратор КАК Документ.УПН_ДоговорПоНедвижимости).УСОERP_ВидДоговора, ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ПустаяСсылка)
	|	КОНЕЦ КАК ВидДоговора
	|ПОМЕСТИТЬ ВТ_ДанныеПоДоговорам
	|ИЗ
	|	РегистрСведений.УСОERP_СоответствиеДоговоровИДолей.СрезПоследних(
	|			&КонецПериода,
	|			Доля В
	|					(ВЫБРАТЬ
	|						ВТ_ОбъектыНедвижимости.ОбъектНедвижимости
	|					ИЗ
	|						ВТ_ОбъектыНедвижимости КАК ВТ_ОбъектыНедвижимости)
	|				И Договор.Организация = &Организация) КАК УСОERP_СоответствиеДоговоровИДолейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ИСТИНА)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.Жилая)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьСобственныхЖилыхПомещений,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ИСТИНА)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.Коммерческая)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьСобственныхНежилыхПомещений,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ИСТИНА)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.ГаражМашиноместо)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьСобственныхМашиномест,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ЛОЖЬ)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.Жилая)
	|				И ВТ_ДанныеПоДоговорам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ДоговорДолевогоУчастия)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьЖилыхПомещенийДДУ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ЛОЖЬ)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.Коммерческая)
	|				И ВТ_ДанныеПоДоговорам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ДоговорДолевогоУчастия)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьНежилыхПомещенийДДУ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ЛОЖЬ)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.ГаражМашиноместо)
	|				И ВТ_ДанныеПоДоговорам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ДоговорДолевогоУчастия)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьМашиноместДДУ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ЛОЖЬ)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.Жилая)
	|				И ВТ_ДанныеПоДоговорам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ИнвестиционныйДоговор)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьЖилыхПомещенийИнвест,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ЛОЖЬ)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.Коммерческая)
	|				И ВТ_ДанныеПоДоговорам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ИнвестиционныйДоговор)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьНежилыхПомещенийИнвест,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_ДанныеПоДоговорам.Расторгнут, ЛОЖЬ)
	|				И ВТ_ОбъектыНедвижимости.ТипНедвижимости = ЗНАЧЕНИЕ(Перечисление.УПН_ТипыНедвижимости.ГаражМашиноместо)
	|				И ВТ_ДанныеПоДоговорам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыДоговоровПоНедвижимости.ИнвестиционныйДоговор)
	|			ТОГДА ЕСТЬNULL(ВТ_ПлощадиОбъектов.ОбщаяПлощадь, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлощадьМашиноместИнвест,
	|	ВТ_ОбъектыНедвижимости.ТипНедвижимости,
	|	ЕСТЬNULL(ВТ_ДанныеПоДоговорам.ДоговорПоНедвижимости, ЗНАЧЕНИЕ(Документ.УПН_ДоговорПоНедвижимости.ПустаяСсылка)) КАК Договор
	|ИЗ
	|	ВТ_ОбъектыНедвижимости КАК ВТ_ОбъектыНедвижимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадиОбъектов КАК ВТ_ПлощадиОбъектов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоДоговорам КАК ВТ_ДанныеПоДоговорам
	|			ПО ВТ_ПлощадиОбъектов.ОбъектНедвижимости = ВТ_ДанныеПоДоговорам.ОбъектНедвижимости
	|		ПО ВТ_ОбъектыНедвижимости.ОбъектНедвижимости = ВТ_ПлощадиОбъектов.ОбъектНедвижимости
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектНедвижимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ОбъектыНедвижимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПлощадиОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДанныеПоДоговорам";
	
	Запрос.УстановитьПараметр("КонецПериода", Новый граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектЭксплуатации", Объект.ОбъектЭксплуатации);
	Запрос.УстановитьПараметр("ПоОбмерамБТИ", Объект.ПоОбмерамБТИ);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ОтборПоОбъектуНедвижимости = Ложь;
	ОбъектНедвижимости = Справочники.АУН_ОбъектыНедвижимости.ПустаяСсылка();
	
	Если Не ИдентификаторСтроки = Неопределено Тогда
		ОтборПоОбъектуНедвижимости = Истина;
		СтрокаТЧ = Объект.ОбъектыНедвижимости.НайтиПоИдентификатору(ИдентификаторСтроки);
		ОбъектНедвижимости = СтрокаТЧ.ОбъектНедвижимости;
		СтрокаТЧ.ТипНедвижимости = СтрокаТЧ.ОбъектНедвижимости.ТипНедвижимости;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъектНедвижимости", ОбъектНедвижимости);
	Запрос.УстановитьПараметр("ОтборПоОбъекту", ОтборПоОбъектуНедвижимости);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ОтборПоОбъектуНедвижимости Тогда
		Если Результат.Количество() = 0 Тогда
			СтрокаТЧ.ПлощадьСобственныхЖилыхПомещений		= 0;	
			СтрокаТЧ.ПлощадьСобственныхНежилыхПомещений		= 0;
			СтрокаТЧ.ПлощадьСобственныхМашиномест 			= 0;
			СтрокаТЧ.ПлощадьЖилыхПомещенийДДУ 				= 0;
			СтрокаТЧ.ПлощадьНежилыхПомещенийДДУ 			= 0;
			СтрокаТЧ.ПлощадьМашиноместДДУ 					= 0;
			СтрокаТЧ.ПлощадьЖилыхПомещенийИнвест 			= 0;
			СтрокаТЧ.ПлощадьНежилыхПомещенийИнвест 			= 0;
			СтрокаТЧ.ПлощадьМашиноместИнвест 				= 0;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Результат[0]);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если НЕ ТолькоДанныеПоПлощадям Тогда
		Объект.ОбъектыНедвижимости.Очистить();
		Объект.ОбъектыНедвижимости.Загрузить(Результат);
	Иначе
		Для Каждого СтрОН Из Объект.ОбъектыНедвижимости Цикл
			МассивДанных = Результат.НайтиСтроки(Новый структура("ОбъектНедвижимости", СтрОН.ОбъектНедвижимости));
			Если МассивДанных.Количество() = 0 Тогда
				СтрОН.ПлощадьСобственныхЖилыхПомещений		= 0;	
				СтрОН.ПлощадьСобственныхНежилыхПомещений	= 0;
				СтрОН.ПлощадьСобственныхМашиномест 			= 0;
				СтрОН.ПлощадьЖилыхПомещенийДДУ 				= 0;
				СтрОН.ПлощадьНежилыхПомещенийДДУ 			= 0;
				СтрОН.ПлощадьМашиноместДДУ 					= 0;
				СтрОН.ПлощадьЖилыхПомещенийИнвест 			= 0;
				СтрОН.ПлощадьНежилыхПомещенийИнвест 		= 0;
				СтрОН.ПлощадьМашиноместИнвест 				= 0;
			Иначе
				ЗаполнитьЗначенияСвойств(СтрОН, МассивДанных[0]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбъектыНедвижимостиТЧ = ТекущийОбъект.ОбъектыНедвижимости.Выгрузить();
		ОбъектыНедвижимостиТЧ.Свернуть("ОбъектНедвижимости");
		Если Не ОбъектыНедвижимостиТЧ.Количество() = ТекущийОбъект.ОбъектыНедвижимости.Количество() Тогда
			
			ТекстОшибок = "";
			Для Каждого СтрПроверка Из ОбъектыНедвижимостиТЧ Цикл
				ТекстОшибки = "";
				НомераСтрок = "";
				МассивДанных = ТекущийОбъект.ОбъектыНедвижимости.НайтиСтроки(Новый структура( "ОбъектНедвижимости", СтрПроверка.ОбъектНедвижимости));
				Если МассивДанных.Количество()>1 Тогда
					ТекстОшибки = "Данные по объекту ";
					ТекстОшибки = ТекстОшибки + СтрПроверка.ОбъектНедвижимости + " задублированы в строках: "; 				
					Для Каждого СтрДубль Из МассивДанных Цикл
						Если НомераСтрок = "" Тогда
							НомераСтрок = НомераСтрок +  Строка(СтрДубль.номерСтроки);
						Иначе
							НомераСтрок = НомераСтрок + ", " + Строка(СтрДубль.номерСтроки);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				ТекстОшибок = ТекстОшибок + ТекстОшибки + НомераСтрок + Символы.ПС;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СокрЛП(ТекстОшибок));
			Отказ = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыНедвижимости()
	
	Для Каждого СтрокаТЗ Из Объект.ОбъектыНедвижимости Цикл
		СтрокаТЗ.ТипНедвижимости = СтрокаТЗ.ОбъектНедвижимости.ТипНедвижимости;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
